const ALL_GENRES = '';

const MovieGenres = [
  {
    id: ALL_GENRES,
    name: 'Все жанры',
  },
  {
    id: 12,
    name: 'Приключения',
  },
  {
    id: 14,
    name: 'Фентези',
  },
  {
    id: 16,
    name: 'Мультфильмы',
  },
  {
    id: 18,
    name: 'Драма',
  },
  {
    id: 27,
    name: 'Ужасы',
  },
  {
    id: 28,
    name: 'Боевики',
  },
  {
    id: 35,
    name: 'Комедии',
  },
  {
    id: 36,
    name: 'Исторические',
  },
  {
    id: 37,
    name: 'Вестерны',
  },
  {
    id: 53,
    name: 'Триллеры',
  },
  {
    id: 80,
    name: 'Криминальные',
  },
  {
    id: 99,
    name: 'Документальные',
  },
  {
    id: 878,
    name: 'Фантастика',
  },
  {
    id: 9648,
    name: 'Детективы',
  },
  {
    id: 10402,
    name: 'Музыкальные',
  },
  {
    id: 10749,
    name: 'Мелодрамы',
  },
  {
    id: 10751,
    name: 'Семейные',
  },
  {
    id: 10752,
    name: 'Военные',
  },
  {
    id: 10770,
    name: 'Телевизионные фильмы',
  },
];

const TvGenres = [
  {
    id: ALL_GENRES,
    name: 'Все жанры',
  },
  {
    id: 16,
    name: 'Мультфильмы',
  },
  {
    id: 18,
    name: 'Драма',
  },
  {
    id: 35,
    name: 'Комедии',
  },
  {
    id: 37,
    name: 'Вестерн',
  },
  {
    id: 80,
    name: 'Криминальные',
  },
  {
    id: 99,
    name: 'Документальные',
  },
  {
    id: 9648,
    name: 'Детективы',
  },
  {
    id: 10751,
    name: 'Семейные',
  },
  {
    id: 10759,
    name: 'Боевики и приключения',
  },
  {
    id: 10762,
    name: 'Детские',
  },
  {
    id: 10763,
    name: 'Новости',
  },
  {
    id: 10764,
    name: 'Реалити-шоу',
  },
  {
    id: 10765,
    name: 'Научная фантастика и фентези',
  },
  {
    id: 10766,
    name: 'Мыльная опера',
  },
  {
    id: 10767,
    name: 'Ток-шоу',
  },
  {
    id: 10768,
    name: 'Война и политика',
  },
];

export {
  ALL_GENRES,
  MovieGenres,
  TvGenres,
};
